I'm encountering the same issue. I have a Cloudwatch rule with a target. When TF decided that the Rule had to delete and re-create the rule, it did not plan the target removal and recreation in the right order. 

Shown below, the plan follows this pattern:

1. Trigger destroy of Rule
2. Trigger update of (other) rule
3. Update of (other) rule completes
4. Operation times out after 5 minutes

The plan doesn't even "intend" to update targets.

The plan should look like this, to avoid this error:

1. Trigger update of (other) rule
2. Trigger destroy of target(s)
3. Trigger destroy of rule
4. Trigger re-creation of rule
5. trigger re-creation of target(s)


Actual output of apply:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cloudwatch-alarm-forwarder must be replaced
-/+ resource "aws_cloudwatch_event_rule" "cloudwatch-alarm-forwarder" {
      ~ arn            = "<redacted>missed_file_catcher-schedule" -> (known after apply)
      ~ description    = "triggers the 'Missed file catcher' lambda" -> "Sends Alarm info on, with more flexibility than the alarms have"
        event_bus_name = "default"
      ~ event_pattern  = jsonencode(
          ~ {
              + detail      = {
                  + state = {
                      + value = [
                          + "ALARM",
                        ]
                    }
                }
                detail-type = [
                    "CloudWatch Alarm State Change",
                ]
              + resources   = [
                  + "<redacted>:alarm:Lambda-Timeout",
                  + "<redacted>:alarm:Lambda-OverMemoryQuota",
                ]
                source      = [
                    "aws.cloudwatch",
                ]
            }
        )
      ~ id             = "<redacted>-missed_file_catcher-schedule" -> (known after apply)
        is_enabled     = true
      ~ name           = "<redacted>-missed_file_catcher-schedule" -> "<redacted>-cloudwatch-alarm-forwarder" # forces replacement
      + name_prefix    = (known after apply)
        tags           = {
            <redacted>
        }
        tags_all       = {
            <redacted>
        }
    }

  # aws_cloudwatch_event_rule.missed_file_catcher_schedule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "missed_file_catcher_schedule" {
        arn                 = "<redacted>-missed_file_catcher-schedule"
        description         = "triggers the 'Missed file catcher' lambda"
        event_bus_name      = "default"
      - event_pattern       = jsonencode(
            {
              - detail-type = [
                  - "CloudWatch Alarm State Change",
                ]
              - source      = [
                  - "aws.cloudwatch",
                ]
            }
        ) -> null
        id                  = "<redacted>-missed_file_catcher-schedule"
        is_enabled          = true
        name                = "<redacted>-missed_file_catcher-schedule"
      + schedule_expression = "cron(05 19 ? * 6 *)"
        tags                = {
            <redacted>
        }
        tags_all            = {
            <redacted>
        }
    }

  # aws_cloudwatch_event_target.cloudwatch-alarm-forwarder-to-lambda will be created
  + resource "aws_cloudwatch_event_target" "cloudwatch-alarm-forwarder-to-lambda" {
      + arn            = "<redacted>-missed_file_catcher"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_cloudwatch_event_rule.cloudwatch-alarm-forwarder: Destroying... [id=<redacted>]
aws_cloudwatch_event_rule.missed_file_catcher_schedule: Modifying... [id=<redacted>]
aws_cloudwatch_event_rule.missed_file_catcher_schedule: Modifications complete after 0s [id=<redacted>missed_file_catcher-schedule]
aws_cloudwatch_event_rule.cloudwatch-alarm-forwarder: Still destroying... [id=<redacted>-missed_file_catcher-schedule, 10s elapsed]
aws_cloudwatch_event_rule.cloudwatch-alarm-forwarder: Still destroying... [id=<redacted>-missed_file_catcher-schedule, 20s elapsed]
< trim repeated message at 10s intervals >
aws_cloudwatch_event_rule.cloudwatch-alarm-forwarder: Still destroying... [id=<redacted>-missed_file_catcher-schedule, 4m40s elapsed]
aws_cloudwatch_event_rule.cloudwatch-alarm-forwarder: Still destroying... [id=<redacted>-missed_file_catcher-schedule, 4m50s elapsed]

Error: error deleting CloudWatch Events Rule (<redacted>-missed_file_catcher-schedule): ValidationException: Rule can't be deleted since it has targets.
        status code: 400, request id: a2199299-d0ea-4a03-890e-cbfb9e09df04
```